{"format": "layers-model", "generatedBy": "keras v2.3.0-tf", "convertedBy": "TensorFlow.js Converter v2.1.0", "modelTopology": {"keras_version": "2.3.0-tf", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "learn2sofi", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [1, 491520], "dtype": "float32", "sparse": false, "ragged": false, "name": "x_input"}, "name": "x_input", "inbound_nodes": []}, {"class_name": "Reshape", "config": {"name": "reshape_3d", "trainable": true, "dtype": "float32", "target_shape": [30, 128, 128]}, "name": "reshape_3d", "inbound_nodes": [[["x_input", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_4d", "trainable": true, "dtype": "float32", "target_shape": [30, 128, 128, 1]}, "name": "reshape_4d", "inbound_nodes": [[["reshape_3d", 0, 0, {}]]]}, {"class_name": "ConvLSTM2D", "config": {"name": "convlstm2d_1", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "tanh", "recurrent_activation": "hard_sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0}, "name": "convlstm2d_1", "inbound_nodes": [[["reshape_4d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv_1", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv_1", "inbound_nodes": [[["convlstm2d_1", 0, 0, {}]]]}, {"class_name": "UpSampling2D", "config": {"name": "upsampling_1", "trainable": true, "dtype": "float32", "size": [2, 2], "data_format": "channels_last", "interpolation": "nearest"}, "name": "upsampling_1", "inbound_nodes": [[["conv_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["upsampling_1", 0, 0, {}]]]}, {"class_name": "Reshape", "config": {"name": "reshape_2d_1d", "trainable": true, "dtype": "float32", "target_shape": [65536]}, "name": "reshape_2d_1d", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}], "input_layers": [["x_input", 0, 0]], "output_layers": [["reshape_2d_1d", 0, 0]]}}, "training_config": {"loss": "mean_absolute_error", "metrics": ["accuracy"], "weighted_metrics": null, "loss_weights": null, "sample_weight_mode": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "conv2d_1/kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "conv2d_1/bias", "shape": [1], "dtype": "float32"}, {"name": "conv_1_1/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "conv_1_1/bias", "shape": [16], "dtype": "float32"}, {"name": "convlstm2d_1_1/kernel", "shape": [3, 3, 1, 64], "dtype": "float32"}, {"name": "convlstm2d_1_1/recurrent_kernel", "shape": [3, 3, 16, 64], "dtype": "float32"}, {"name": "convlstm2d_1_1/bias", "shape": [64], "dtype": "float32"}]}]}